Autodesk.Revit.DB.Document.Delete(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Deletes a set of elements from the document.
Remarks:
This method will delete the elements and any elements that are totally dependent upon that element. Any references to the deleted elements will become invalid and hence cause an exception to be thrown if they are accessed.
The elements will be deleted with no prompts for user confirmation.  Pinned elements will be deleted with no warnings.
Note: in a family document, the predefined elements (those elements inherited from its family template file) can't be deleted by this method.
elementIds:
The ids of the elements to delete.
Returns:
The deleted element id set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more elements in elementIds do not exist in the document.
-or-
One or more of the elementIds cannot be deleted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.

Autodesk.Revit.DB.Document.SynchronizeWithCentral(Autodesk.Revit.DB.TransactWithCentralOptions,Autodesk.Revit.DB.SynchronizeWithCentralOptions)
Performs reload latest until the model in the current session is up to date and then saves changes back to central.
A save to central is performed even if no changes were made.
transactOptions:
Options to customize behavior accessing the central model.
syncOptions:
Options to customize behavior of SynchronizeWithCentral.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralFileCommunicationException:
The file-based central model could not be reached, because e.g. the network is down or the file server is down.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied due to lack of access privileges.
-or-
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model is locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
Username does not match the one used to create the local file.
-or-
Revit could not save all of the worksets that have been changed.  Try again.
-or-
Some of the elements you changed in this model are now editable by someone else, or you checked out worksets that were at risk
or relinquished in the central model but not this file.  You cannot synchronize with the central model until the other user
relinquishes these elements without making changes.
-or-
The central model has been replaced by a local model.
-or-
Local incompatible because it was closed without saving after synchronizing with central.
-or-
The central model is missing.
-or-
The central model is incompatible.
-or-
The central model is corrupt or not an RVT file.
-or-
The central model was rolled back.
-or-
The central model's elements have been relinquished
-or-
Your data or permissions saving is aborted by another user.
-or-
The central model is overritten by other user.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
Cannot access the local file.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a primary document, it is a linked document.
-or-
This Document is read-only: It cannot be modified.
-or-
This Document has an open editing transaction and is accepting changes.
-or-
This Document has is in an edit mode or is in family mode.
-or-
Saving is not allowed in the current application mode.
-or-
This Document does not have a central location: Worksharing needs to be enabled and central model saved.
-or-
This Document is a local file that is not owned by the current user, who therefore is not allowed to modify it.
-or-
The local file is read-only.
It can not be saved before or after synchronizing with central.
-or-
Saving local before first reload latest and after saving changes to central
in Synchronize with Central is mandatory for server-based local models.
-or-
Operation is not permitted when there is any open sub-transaction, transaction, or transaction group.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be reached
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
The disk space is running low on server, please contact the server administrator.
-or-
An internal error happened on the server, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not sign in to Autodesk 360.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the specified A360 project.
Since:
2014

Autodesk.Revit.DB.Document.ReloadLatest(Autodesk.Revit.DB.ReloadLatestOptions)
Fetches changes from central (due to one or more synchronizations with central)
and merges them into the current session.
Remarks:
After this call finishes, use hasAllChangesFromCentral to confirm that there were no
Synchronizations with Central performed during execution of ReloadLatest.
reloadOptions:
Various options to control behavior of reloadLatest.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralFileCommunicationException:
The file-based central model could not be reached, because e.g. the network is down or the file server is down.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied due to lack of access privileges.
-or-
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model is locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
Username does not match the one used to create the local file.
-or-
Revit could not save all of the worksets that have been changed. Try again.
-or-
The central model has been replaced by a local model.
-or-
Local incompatible because it was closed without saving after synchronizing with central.
-or-
The central model is missing.
-or-
The central model is incompatible.
-or-
The central model is corrupt or not an RVT file.
-or-
The central model was rolled back.
-or-
The central model's elements have been relinquished
-or-
The central model is overritten by other user.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
Cannot access the local file.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a primary document, it is a linked document.
-or-
This Document is not a local model: it is not workshared or is central.
-or-
This Document is read-only: It cannot be modified.
-or-
This Document has an open editing transaction and is accepting changes.
-or-
This Document has is in an edit mode or is in family mode.
-or-
This Document is a local file that is not owned by the current user, who therefore is not allowed to modify it.
-or-
Operation is not permitted when there is any open sub-transaction, transaction, or transaction group.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not sign in to Autodesk 360.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the specified A360 project.
Since:
2014

Autodesk.Revit.DB.Document.Export(System.String,System.String,Autodesk.Revit.DB.GBXMLExportOptions)
Export the model in gbXML (green-building) format.
Remarks:
Export the model in gbXML (green-building) format
folder:
Indicates the path of a folder where to export the gbXML file.
name:
Indicates the name of the gbXML file to export. If it doesn't end with ".xml", extension ".xml" will be added automatically. The name cannot contain any of the following characters: \/:*?"<>|. Empty name is not acceptable.
options:
Options which control the contents of the export.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The path is not valid for exporting gbXML files.
-or-
The name is empty or not valid for exporting gbXML files.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Exporting is not allowed in the current application mode.
-or-
Export is temporarily disabled.

Autodesk.Revit.DB.Document.PostFailure(Autodesk.Revit.DB.FailureMessage)
Posts a failure to be displayed to the user at the end of transaction.
Remarks:
If code inside transaction detects a problem that needs to be communicated to the user,
it should report these conditions via this method. Failures will be validated and possibly
resolved at the end of transaction.
Warnings posted via this method will not be stored in the document after they are resolved.
A unique key returned by postFailure can be stored for the lifetime of transaction and used to
remove failure message if it is no longer relevant.
failure:
The failure to be posted.
Returns:
A unique key that identifies posted failure message in a document. If exactly the same error is posted more than once,
and not removed between the postings, returned key will be the same every time.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2011

Autodesk.Revit.DB.Document.Export(System.String,System.String,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.SATExportOptions)
Exports the current view or a selection of views in SAT format.
Remarks:
All the views must be printable for the Export to succeed.
It can be assured by checking the CanBePrinted property of each view.
folder:
Output folder, into which file(s) will be exported. The folder must exist.
name:
Either the name of a single file or a prefix for a set of files.
If empty, automatic naming will be used.
views:
Selection of views to be exported. The set must contain at least one valid view.
options:
Various options applicable to the SAT format.For now, this option is empty.
If null, all options will be set to their respective default values.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters
-or-
non empty list of views must be provided
-or-
some of the views is not printable(exportable)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DirectoryNotFoundException:
Thrown when the directory does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The SAT module is not available in the installed Revit.
-or-
The Graphics module is not available in the installed Revit.
Since:
2014

Autodesk.Revit.DB.Document.Export(System.String,System.String,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.DGNExportOptions)
Exports a selection of views in DGN format.
Remarks:
All the views must be printable for the Export to succeed.
It can be assured by checking the CanBePrinted property of each view.
folder:
Output folder, into which file(s) will be exported. The folder must exist.
name:
Either the name of a single file or a prefix for a set of files.
If empty, automatic naming will be used.
If null, throw ArgumentException.
views:
Selection of views to be exported. The set must contain at least one valid view.
options:
Various options applicable to the DGN format.
If null, all options will be set to their respective default values.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters
-or-
non empty list of views must be provided
-or-
some of the views is not printable(exportable)
-or-
Thrown when the options in DGNExportOptions is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DirectoryNotFoundException:
Thrown when the directory does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The DWG module is not available in the installed Revit.
-or-
The Graphics module is not available in the installed Revit.

Autodesk.Revit.DB.Document.Export(System.String,System.String,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.DXFExportOptions)
Exports a selection of views in DXF format.
Remarks:
All the views must be printable for the Export to succeed.
It can be assured by checking the CanBePrinted property of each view.
folder:
Output folder, into which file(s) will be exported. The folder must exist.
name:
Either the name of a single file or a prefix for a set of files.
If empty, automatic naming will be used.
views:
Selection of views to be exported. The set must contain at least one valid view.
options:
Various options applicable to the DXF format.
If null, all options will be set to their respective default values.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters
-or-
non empty list of views must be provided
-or-
some of the views is not printable(exportable)
-or-
Thrown when the options in DWGExportOptions is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DirectoryNotFoundException:
Thrown when the directory does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The DXF module is not available in the installed Revit.
-or-
The Graphics module is not available in the installed Revit.

Autodesk.Revit.DB.Document.Export(System.String,System.String,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.DWGExportOptions)
Exports a selection of views in DWG format.
Remarks:
All the views must be printable for the Export to succeed.
It can be assured by checking the CanBePrinted property of each view.
folder:
Output folder, into which file(s) will be exported. The folder must exist.
name:
Either the name of a single file or a prefix for a set of files.
If empty, automatic naming will be used.
If null, throw ArgumentException.
views:
Selection of views to be exported. The set must contain at least one valid view.
options:
Various options applicable to the DWG format.
If null, all options will be set to their respective default values.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters
-or-
non empty list of views must be provided
-or-
some of the views is not printable(exportable)
-or-
The modifiers set in layer info must be valid.
-or-
Thrown when the options in DWGExportOptions is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DirectoryNotFoundException:
Thrown when the directory does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The DWG module is not available in the installed Revit.
-or-
The Graphics module is not available in the installed Revit.

Autodesk.Revit.DB.Document.EnableWorksharing(System.String,System.String)
Enables worksharing in the document.
Remarks:
The document's Undo history will be cleared by this command. As a result, this command and others executed before it cannot be undone.
All transaction phases (e.g. transactions transaction groups and sub-transaction) that were explicitly started must be finished prior to calling this method.
worksetNameGridLevel:
Name of workset for grids and levels.
worksetName:
Name of workset for all other elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
worksetNameGridLevel is an empty string.
-or-
worksetName is an empty string.
-or-
worksetNameGridLevel cannot include prohibited characters.
-or-
worksetName cannot include prohibited characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document does not allow worksharing to be enabled.
-or-
This Document has is in an edit mode or is in family mode.
-or-
This Document is a workshared document.
-or-
There is a transaction phase left open (such as a transaction, sub-transaction of transaction group) at the time of invoking this method.
Since:
2014

Autodesk.Revit.DB.Document.LoadFamilySymbol(System.String,System.String,Autodesk.Revit.DB.IFamilyLoadOptions,Autodesk.Revit.DB.FamilySymbol@)
Loads only the specified family type/symbol from a family file into the document and
provides a reference to the loaded family symbol.
filename: The fully qualified filename of the Family file, usually ending in .rfa.
name: The name of the type/symbol to be loaded, such as "W11x14".
familyLoadOptions: The interface implementation to use when loading a family into the document.
symbol: A reference to the family symbol that was loaded if successful, otherwise Nothing.
Returns: True if the family type/symbol was loaded successfully into the project, otherwise False.
Remarks: The path to the installed Autodesk Revit family files can be found by using the
Application.Options object and its methods. The name of the family type/symbol is the same name
as returned by the Name property on the FamilySymbol object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when filename or name is null or empty.
Since: 2011

Autodesk.Revit.DB.Document.LoadFamilySymbol(System.String,System.String,Autodesk.Revit.DB.FamilySymbol@)
Loads only the specified family type/symbol from a family file into the document and
provides a reference to the loaded family symbol.
filename: The fully qualified filename of the Family file, usually ending in .rfa.
name: The name of the type/symbol to be loaded, such as "W11x14".
symbol: A reference to the family symbol that was loaded if successful, otherwise null.
Returns: True if the family type/symbol was loaded successfully into the project, otherwise False.
Remarks: The path to the installed Autodesk Revit family files can be found by using the
Application.Options object and its methods. The name of the family type/symbol is the same name
as returned by the Name property on the FamilySymbol object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when filename or name is null or empty.

Autodesk.Revit.DB.Document.LoadFamilySymbol(System.String,System.String)
Loads only a specified family type/symbol from a family file into the document.
Loads only a specified family type/symbol from a family file into the document.
filename: The fully qualified filename of the Family file, usually ending in .rfa.
name: The name of the type/symbol to be loaded, such as "W11x14".
Returns: True if the family type/symbol was loaded successfully into the project, otherwise False.
Remarks: The path to the installed Autodesk Revit family files can be found by using the
Application.Options object and its methods. The name of the family type/symbol is the same name
as returned by the Name property on the FamilySymbol object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when filename or name is null or empty.

Autodesk.Revit.DB.Document.LoadFamily(Autodesk.Revit.DB.Document)
Loads the contents of this family document into another document.
targetDocument: The target document where the family will be loaded.
Returns: Reference of the family in the target document.
Remarks: If you are reloading an edited family back into the source document from which it was extracted, this method will always fail.
This is because this method automatically suppresses the prompts Revit typically uses to deal with conflicts between families, and
assumes that any such conflict should prevent the loading.  If you want to be able to reload the same family into the source document,
you should use the LoadFamily overload accepting Autodesk.Revit.DB.IFamilyLoadOptions.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"targetDocument"-is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the current document is not a family document,
or when the target document is modifiable (e.g. there is an uncommitted transaction) or doesn't support load of this kind of families (e.g. loading a model family to detail family is disallowed),
or when this family was found in the target document already and the conflict caused an automatic abort of the load operation,
or when a shared family in this family was found in the target document already
and the conflict caused an automatic abort of the load operation,
or this document is currently in a read-only state.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
Thrown if this method is called during dynamic update.

Autodesk.Revit.DB.Document.LoadFamily(System.String,Autodesk.Revit.DB.IFamilyLoadOptions,Autodesk.Revit.DB.Family@)
Loads an entire family and all its types/symbols into the document and provides a reference
to the loaded family.
filename: The fully qualified filename of the Family file, usually ending in .rfa.
familyLoadOptions: The interface implementation to use when loading a family into the document.
family: A reference to the family that was loaded if successful, otherwise Nothing.
Returns: True if the entire family was loaded successfully into the project, otherwise False.
Remarks: Loading an entire family may take a considerable amount of time and memory. It is
recommended that you use LoadFamilySymbol and only load those symbols that you need. The path to
the installed Autodesk Revit family files can be found by using the Application.Options object
and its methods.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when filename is null or empty.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument "familyLoadOptions" is null.
Since: 2011

Autodesk.Revit.DB.Document.LoadFamily(System.String,Autodesk.Revit.DB.Family@)
Loads an entire family and all its types/symbols into the document and provides a reference
to the loaded family.
filename: The fully qualified filename of the Family file, usually ending in .rfa.
family: A reference to the family that was loaded if successful, otherwise null.
Returns: True if the entire family was loaded successfully into the project, otherwise False.
Remarks: Loading an entire family may take a considerable amount of time and memory. It is
recommended that you use LoadFamilySymbol and only load those symbols that you need. The path to
the installed Autodesk Revit family files can be found by using the Application.Options object
and its methods.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when filename is null or empty.

Autodesk.Revit.DB.Document.LoadFamily(System.String)
Loads a family and all its types/symbols.
Loads an entire family and all its types/symbols into the document.
filename: The fully qualified filename of the Family file, usually ending in .rfa.
Returns: True if the entire family was loaded successfully into the project, otherwise False.
Remarks: Loading an entire family may take a considerable amount of time and memory. It is
recommended that you use LoadFamilySymbol and only load those symbols that you need. The path to
the installed Autodesk Revit family files can be found by using the Application.Options object
and its methods.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when filename is null or empty.